#### DWFImportOptions Members

---

|  |
| --- |
| DWFImportOptions Class   Constructors   Methods   Properties   See Also |

The  DWFImportOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DWFImportOptions(DWFImportOptions) | Constructs a new instance of DWFImportOptions as a copy of the import options. |
| Public method | DWFImportOptions(IList ElementId ) | Constructs a new instance of DWFImportOptions with an array of imported sheet views. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DWFImportOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSheetViews | Get sheet views where DWF markups are imported. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetSheetViews | Set sheet views where DWF markups are imported. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DWFImportOptions Class

Autodesk.Revit.DB Namespace